In [27]:
import pandas as pd
import numpy as np

# Jupyter 参数设置
# 导入设置后， 在一个cell 可以输出多个值
# 就没有必要用不同的cell去运行
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

Pandas 的两种数据结构 `Series` 和 `DataFrame`
## Series

In [3]:
from pandas import Series, DataFrame

In [4]:
tmp1 = Series(['this', 'is', 'tmp'])
tmp1

tmp2 = Series(['test', 'file'], index= ['a', 'b'])
tmp2

0    this
1      is
2     tmp
dtype: object

a    test
b    file
dtype: object

In [9]:
tmp2['a']

'test'

也可以通过字典来创建Series

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
tmp3 = pd.Series(sdata)
tmp3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

## DataFrame

In [20]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.0]}
tmp4 = DataFrame(data)
tmp4

tmp5 = DataFrame(data, columns = ['year', 'state', 'pop']) # 可以改变列的顺序
tmp5

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.0

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

In [22]:
tmp5['money'] = 666 
tmp5

   year   state  pop  money
0  2000    Ohio  1.5    666
1  2001    Ohio  1.7    666
2  2002    Ohio  3.6    666
3  2001  Nevada  2.4    666
4  2002  Nevada  2.9    666
5  2003  Nevada  3.0    666

In [30]:
tmp5['debt'] = np.arange(6.)
tmp5

   year   state  pop  money  debt
0  2000    Ohio  1.5    666   0.0
1  2001    Ohio  1.7    666   1.0
2  2002    Ohio  3.6    666   2.0
3  2001  Nevada  2.4    666   3.0
4  2002  Nevada  2.9    666   4.0
5  2003  Nevada  3.0    666   5.0

In [31]:
tmp_series = Series([1.1, 1.3, 1.6], index = [2, 3, 0])

In [33]:
tmp5['debt'] = tmp_series
tmp5

   year   state  pop  money  debt
0  2000    Ohio  1.5    666   1.6
1  2001    Ohio  1.7    666   NaN
2  2002    Ohio  3.6    666   1.1
3  2001  Nevada  2.4    666   1.3
4  2002  Nevada  2.9    666   NaN
5  2003  Nevada  3.0    666   NaN

In [34]:
del tmp5['money']

In [35]:
tmp5

   year   state  pop  debt
0  2000    Ohio  1.5   1.6
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   1.1
3  2001  Nevada  2.4   1.3
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.0   NaN

In [ ]:
# 
frame2 =